driver-tests/iepse/IEPUnionAll/UnionAllApp/test/PartitionedWindowInput/template2.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:att="PartitionedWindowInput.PartitionedWindowInput_iep">
  <soapenv:Body>
    <att:StreamInput2_MsgObj>
      <LastName>${LastName.0}</LastName>
      <SInteger>${SInteger.0}</SInteger>
      <SDouble>${SDouble.0}</SDouble>
      <SBigint>${SBigint.0}</SBigint>
      <SDate>${SDate.0}</SDate>
      <STime>${STime.0}</STime>
      <STimestamp>${STimestamp.0}</STimestamp>
      <SDesc>${SDesc.0}</SDesc>
    </att:StreamInput2_MsgObj>
  </soapenv:Body>
</soapenv:Envelope>